lzly0302/cch.a-control/soft/cch.a/mde/mde_bough_link/depend/bsp_bough_link_stm32f103RCTB.h
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#ifndef snail_data_types
    #include ".\snail_data_types.h"
#endif
//-------------------------------------------------------------------------------------------------
#include "..\mde_bough_link_half.h"
#include ".\snail_macro.h"
#include "stm32f10x.h"
#include "intrinsics.h"
//-------------------------------------------------------------------------------------------------
#define bgk_s0    0
#define bgk_s1    1
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
/*串口5*/
//uart5 txd--PC12  rxd--PD2   EN5 PC6  BY5 PC7 改为  EN5 PB15  BY5 PB14 
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
macro_creat_queueBasce(uart5_queue_rxd,255);
macro_creat_queueBasce(uart5_queue_txd,255);
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//中断服务函数
//-----------------------------------------------------------------------------
void UART5_IRQHandler(void)
{
    if((SET==USART_GetFlagStatus(UART5,USART_FLAG_ORE))||\
       (SET==USART_GetFlagStatus(UART5,USART_FLAG_NE))||\
       (SET==USART_GetFlagStatus(UART5,USART_FLAG_FE)))
    {
        USART_GetFlagStatus(UART5,USART_FLAG_ORE);
        USART_ReceiveData(UART5);
    }
    else if(SET==USART_GetFlagStatus(UART5,USART_FLAG_PE))
    {
        USART_GetFlagStatus(UART5,USART_FLAG_PE);
        USART_ReceiveData(UART5);
    }
    else if(SET==USART_GetFlagStatus(UART5,USART_FLAG_RXNE))
    {
        sdt_int8u Read_reg;
        Read_reg = USART_ReceiveData(UART5);
       
        sdt_int8u n_bytes;
        macro_pull_queueBasce_bytes(uart5_queue_rxd,n_bytes);

        sdt_bool queunIsFull;
        macro_pull_queueBasce_full(uart5_queue_rxd,n_bytes,queunIsFull);
        if(queunIsFull)
        {
        }
        else
        {
            macro_push_queueBasce_data(uart5_queue_rxd,n_bytes,Read_reg);
        }
    }
    if(SET==USART_GetITStatus(UART5,USART_IT_TC))
    {
        if(SET==USART_GetFlagStatus(UART5,USART_FLAG_TC))
        {
            sdt_int8u n_bytes,rd_byte_details;
            macro_pull_queueBasce_bytes(uart5_queue_txd,n_bytes);
            if(n_bytes)
            {
                macro_pull_queueBasce_data(uart5_queue_txd,n_bytes,rd_byte_details);
                USART_SendData(UART5,rd_byte_details);
            }
            else
            {
                USART_ITConfig(UART5,USART_IT_TC,DISABLE);
            }
        }
    }
}
volatile static sdt_bool  phyBusBusyFlag5 = sdt_false;
void TIM7_IRQHandler(void)
{
    if(SET==TIM_GetFlagStatus(TIM7,TIM_FLAG_Update))
    {
        TIM_ClearFlag(TIM7,TIM_FLAG_Update); 
        phyBusBusyFlag5 = sdt_false;
        TIM_ClearITPendingBit(TIM7, TIM_IT_Update);
        TIM_ClearFlag(TIM7,TIM_FLAG_Update);               //清除溢出中断标志  
        TIM_ITConfig(TIM7,TIM_IT_Update,DISABLE);  
    }
}
void EXTI15_10_IRQHandler(void)
{
   if(EXTI_GetITStatus(EXTI_Line14) != RESET) 
    {//串口5
        EXTI_ClearITPendingBit(EXTI_Line14);
        phyBusBusyFlag5 = sdt_true;
        TIM7->CNT = 0;
        TIM_ClearITPendingBit(TIM7, TIM_IT_Update);
        TIM_ClearFlag(TIM7,TIM_FLAG_Update);               //清除溢出中断标志  
        TIM_ITConfig(TIM7,TIM_IT_Update,ENABLE);  
    }   
}
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//++++++++++++++++++++++++++++++++interface++++++++++++++++++++++++++++++++++++
//-----------------------------------------------------------------------------
void bsp_uart5_cfg(void)
{
    GPIO_InitTypeDef    GPIO_USART5INIT; 
    USART_InitTypeDef   USART5_INIT;
    NVIC_InitTypeDef    USART5_NVIC_INIT;

 //-----------------------------------------------------------------------------   
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART5,ENABLE);  //开启串口时钟
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC,ENABLE);   //开启GPIOC口时钟
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);   //开启GPIOB口时钟
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD,ENABLE);   //开启GPIOD口时钟
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO,ENABLE);
    GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable,ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);   //开启GPIOA口时钟
//-----------------------------------------------------------------------------  
    GPIO_USART5INIT.GPIO_Pin=GPIO_Pin_12;                   //PC12 U5_TXD
    GPIO_USART5INIT.GPIO_Speed=GPIO_Speed_2MHz;
    GPIO_USART5INIT.GPIO_Mode=GPIO_Mode_AF_PP;            //输出复用推挽
    GPIO_Init(GPIOC,&GPIO_USART5INIT);
//-----------------------------------------------------------------------------     
    GPIO_USART5INIT.GPIO_Pin=GPIO_Pin_2;                   //PD2 U5_RXD
    GPIO_USART5INIT.GPIO_Speed=GPIO_Speed_2MHz;
    GPIO_USART5INIT.GPIO_Mode=GPIO_Mode_IPU;               //输入上拉
    GPIO_Init(GPIOD,&GPIO_USART5INIT);
//-----------------------------------------------------------------------------  
    GPIO_USART5INIT.GPIO_Pin=GPIO_Pin_15;                   //PC6 TRSEL  PB15
    GPIO_USART5INIT.GPIO_Mode = GPIO_Mode_IN_FLOATING;//浮空输入
    GPIO_Init(GPIOB,&GPIO_USART5INIT);
    GPIO_ResetBits(GPIOB,GPIO_Pin_15);
    
     /*pc7  PB14*/
    GPIO_InitTypeDef GPIO_InitStructure;
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_14;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;//浮空输入
    GPIO_Init(GPIOB, &GPIO_InitStructure);
    
    GPIO_EXTILineConfig( GPIO_PortSourceGPIOB,  GPIO_PinSource14); 
    EXTI_InitTypeDef EXTI_InitStructure;
    EXTI_InitStructure.EXTI_Line =  EXTI_Line14;
 
      /* EXTI为中断模式 */
    EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
     /* 上升沿下降沿中断 */
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;//EXTI_Trigger_Rising;//EXTI_Trigger_Rising_Falling
    /* 使能中断 */
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    EXTI_Init(&EXTI_InitStructure);
    
    NVIC_InitTypeDef NVIC_InitStructure;
  
  /* 配置NVIC为优先级组1 */
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_0);
  
  /* 配置中断源：按键1 */
    NVIC_InitStructure.NVIC_IRQChannel =  EXTI15_10_IRQn;
  /* 配置抢占优先级 */
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
  /* 配置子优先级 */
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
  /* 使能中断通道 */
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
//-----------------------------------------------------------------------------   
    USART_DeInit(UART5);
    USART5_INIT.USART_BaudRate=9600;
    USART5_INIT.USART_Parity=USART_Parity_No;
    USART5_INIT.USART_WordLength=USART_WordLength_8b;    

