lzly0302/cch.a-control/soft/cch.a/mde/mde_bough_link/depend/bsp_bough_link_stm32f103RCTB.h
    USART5_INIT.USART_StopBits=USART_StopBits_1;
    USART5_INIT.USART_HardwareFlowControl=USART_HardwareFlowControl_None;
    USART5_INIT.USART_Mode=(USART_Mode_Rx+USART_Mode_Tx);  //收发使能
//-----------------------------------------------------------------------------
    USART_Init(UART5,&USART5_INIT);
    USART_ITConfig(UART5,USART_IT_RXNE,ENABLE);           //使能接收中断
    USART_Cmd(UART5,ENABLE);
//-----------------------------------------------------------------------------
    USART5_NVIC_INIT.NVIC_IRQChannel=UART5_IRQn;
    USART5_NVIC_INIT.NVIC_IRQChannelPreemptionPriority=0;  //主优先级
    USART5_NVIC_INIT.NVIC_IRQChannelSubPriority=0;         //子优先级
    USART5_NVIC_INIT.NVIC_IRQChannelCmd=ENABLE;
    NVIC_Init(&USART5_NVIC_INIT);
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
    TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;              //TIM4 3.5T的时序管理
//-----------------------------------------------------------------------------  
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM7, ENABLE); 
    TIM_DeInit(TIM7);
    /* Time base configuration */    
    TIM_TimeBaseStructure.TIM_Prescaler =(720)-1;                    //72M 100k ,10us
    TIM_TimeBaseStructure.TIM_Period =(200-1);                      // 当定时器从0计数到999，即为1000次，为一个定时周期,1个unit 10us
    TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1 ;        //设置时钟分频系数：不分频(这里用不到)
    TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;     //向上计数模式
    TIM_TimeBaseInit(TIM7, &TIM_TimeBaseStructure);
//-----------------------------------------------------------------------------
    TIM_Cmd(TIM7,ENABLE);                              //开启时钟  
    //--------------------------------------------------------------------------------------------
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1);  
    NVIC_InitStructure.NVIC_IRQChannel = TIM7_IRQn;       
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;  
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;   
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;  
    NVIC_Init(&NVIC_InitStructure);  
//-------------------------------------------------------------------------------------------
    TIM_ClearITPendingBit(TIM7, TIM_IT_Update);
    TIM_ClearFlag(TIM7,TIM_FLAG_Update);               //清除溢出中断标志  
    TIM_ITConfig(TIM7,TIM_IT_Update,DISABLE);  
    TIM_Cmd(TIM7,ENABLE);                              //开启时钟  
}

sdt_bool bsp_ms_tim7_busFree(void)
{
    sdt_int16u free_cnt;
    free_cnt = TIM7->CNT;
    if(free_cnt > 50)      //9600 3.5T 1040*3.25/2
    {
        return(sdt_true);
    }
    else
    {
        return(sdt_false);
    }
}

void bsp_check_uart5_phy_bus(void)
{
    if(phyBusBusyFlag5)
    {
        if(bsp_ms_tim7_busFree())
        {
            phyBusBusyFlag5 = sdt_false;
        }
    }
}

sdt_bool bsp_ms_pull_uart5_phyBus_status(void)
{
   return phyBusBusyFlag5;
}
sdt_int8u bsp_ms_pull_uart5_rxd_num(void)
{
    sdt_int8u n_bytes;
    macro_pull_queueBasce_bytes(uart5_queue_rxd,n_bytes);
    return n_bytes;
}

void bsp_look_for_byte_rx_uart5(void)
{
 
    sdt_int8u n_bytes,rd_byte_details;
    __disable_interrupt();
    macro_pull_queueBasce_bytes(uart5_queue_rxd,n_bytes);
    __enable_interrupt();
    if(n_bytes)
    {
        __disable_interrupt();
        macro_pull_queueBasce_data(uart5_queue_rxd,n_bytes,rd_byte_details);
        __enable_interrupt();
        push_bough_one_receive_byte(bgk_s0,rd_byte_details);     //压入一个字节的数据到link
    }
}
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
void bsp_entry_phy_rx_uart5(void)
{
    GPIO_InitTypeDef GPIO_InitStructure;
    GPIO_InitStructure.GPIO_Pin=GPIO_Pin_15;
    GPIO_InitStructure.GPIO_Mode=GPIO_Mode_IN_FLOATING; 
    GPIO_Init(GPIOB,&GPIO_InitStructure);
    GPIO_ResetBits(GPIOB,GPIO_Pin_15);
}
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//对等总线，由发送报文时选择发送方式，此处采用空函数
//------------------------------------------------------------------------------
void bsp_entry_phy_tx_uart5(void)
{
    ;
}
sdt_bool bsp_pull_complete_tx_uart5(void)
{
    sdt_int8u n_bytes;
    
    macro_pull_queueBasce_bytes(uart5_queue_txd,n_bytes);
    if(n_bytes)
    {
        return(sdt_false);
    }
    else
    {
        if(SET==USART_GetITStatus(UART5,USART_IT_TC))
        {
            return(sdt_false);
        }
        else
        {
            bsp_entry_phy_rx_uart5();
            return(sdt_true);
        }      
    }
}
sdt_bool bsp_pull_pyh_busy_uart5(void)
{
    if(phyBusBusyFlag5)
    {
        return(sdt_true);
    }
    return(sdt_false);
}
void bsp_phy_baudrate_calibrate_uart5(void)
{
}


sdt_int16u bsp_transfet_bytes_tx_uart5(sdt_int8u* in_pByte,sdt_int16u in_expect_bytes,sdt_bool in_conflict_check)
{
    //sdt_int16u i = 0;
    if(0 != in_expect_bytes)
    {
        if(in_conflict_check)
        {
            GPIO_InitTypeDef GPIO_InitStructure;
			GPIO_InitStructure.GPIO_Pin=GPIO_Pin_15;
			GPIO_InitStructure.GPIO_Mode=GPIO_Mode_IN_FLOATING; 
			GPIO_Init(GPIOB,&GPIO_InitStructure);
			GPIO_ResetBits(GPIOB,GPIO_Pin_15);//冲突检测，弱上拉发送
        }
        else
        {
             //推挽发送
			GPIO_InitTypeDef GPIO_InitStructure;
			GPIO_InitStructure.GPIO_Pin=GPIO_Pin_15;                   //PB15 TRSEL
			GPIO_InitStructure.GPIO_Speed=GPIO_Speed_2MHz;
			GPIO_InitStructure.GPIO_Mode=GPIO_Mode_Out_PP;            //推挽输出
			GPIO_Init(GPIOB,&GPIO_InitStructure);
			GPIO_SetBits(GPIOB,GPIO_Pin_15);
        }
		sdt_int8u n_bytes;
		__disable_interrupt();
		macro_pull_queueBasce_bytes(uart5_queue_txd,n_bytes);
		__enable_interrupt();
		sdt_bool queunIsFull;
		macro_pull_queueBasce_full(uart5_queue_txd,n_bytes,queunIsFull);
		if(queunIsFull)
		{
			return(0);
		}
		else
		{
			__disable_interrupt();
			macro_push_queueBasce_data(uart5_queue_txd,n_bytes,in_pByte[0]);
			__enable_interrupt();
			USART_ITConfig(UART5,USART_IT_TC,ENABLE);
			return(in_expect_bytes-1);                              
		}     
    }
    return(0);
}
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//name:压入一个字节的数据到发送队列
//out: sdt_true 压入成功，sdt_false 压入失败
//-----------------------------------------------------------------------------

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//sdt_bool bsp_ms_pull_uart5_txd_cmp(void)
//{
//    sdt_int8u n_bytes;
//    
//    macro_pull_queueBasce_bytes(uart5_queue_txd,n_bytes);
//    if(n_bytes)
//    {
//        return(sdt_false);
//    }
//    else
//    {
//        if(SET==USART_GetITStatus(UART5,USART_IT_TXE))
//        {
//            return(sdt_false);
//        }
//        else
//        {
//            return(sdt_true);
//        }      
//    }
//}

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
void bsp_ms_uart5_phyReCfg(sdt_int32u sys_fre,sdt_int32u baud_rate,sdt_int8u parity,sdt_int8u stop_bits)
{
    USART_InitTypeDef   USART5_INIT;

    USART_DeInit(UART5);
    USART5_INIT.USART_BaudRate=9600;
    USART5_INIT.USART_Parity=USART_Parity_No;
    USART5_INIT.USART_WordLength=USART_WordLength_8b;    

