lzly0302/cch.a-control/soft/cch.a/mde/mde_bough_link/depend/bsp_bough_link_stm32f103RCTB.h
    USART5_INIT.USART_StopBits=USART_StopBits_1;
    USART5_INIT.USART_HardwareFlowControl=USART_HardwareFlowControl_None;
    USART5_INIT.USART_Mode=(USART_Mode_Rx+USART_Mode_Tx);  //收发使能
//-----------------------------------------------------------------------------
    USART_Init(UART5,&USART5_INIT);
}



//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
/*串口2*/
//uart2 txd--PA2  rxd--PA3   EN2 PA4  BY2 PA5  
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
macro_creat_queueBasce(uart2_queue_rxd,255);
macro_creat_queueBasce(uart2_queue_txd,255);
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//中断服务函数
//-----------------------------------------------------------------------------
void USART2_IRQHandler(void)
{
    if((SET==USART_GetFlagStatus(USART2,USART_FLAG_ORE))||\
       (SET==USART_GetFlagStatus(USART2,USART_FLAG_NE))||\
       (SET==USART_GetFlagStatus(USART2,USART_FLAG_FE)))
    {
        USART_GetFlagStatus(USART2,USART_FLAG_ORE);
        USART_ReceiveData(USART2);
    }
    else if(SET==USART_GetFlagStatus(USART2,USART_FLAG_PE))
    {
        USART_GetFlagStatus(USART2,USART_FLAG_PE);
        USART_ReceiveData(USART2);
    }
    else if(SET==USART_GetFlagStatus(USART2,USART_FLAG_RXNE))
    {
        sdt_int8u Read_reg;
        Read_reg = USART_ReceiveData(USART2);
       
        sdt_int8u n_bytes;
        macro_pull_queueBasce_bytes(uart2_queue_rxd,n_bytes);

        sdt_bool queunIsFull;
        macro_pull_queueBasce_full(uart2_queue_rxd,n_bytes,queunIsFull);
        if(queunIsFull)
        {
        }
        else
        {
            macro_push_queueBasce_data(uart2_queue_rxd,n_bytes,Read_reg);
        }
    }
    if(SET==USART_GetITStatus(USART2,USART_IT_TXE))
    {
        if(SET==USART_GetFlagStatus(USART2,USART_FLAG_TXE))
        {
            sdt_int8u n_bytes,rd_byte_details;
            macro_pull_queueBasce_bytes(uart2_queue_txd,n_bytes);
            if(n_bytes)
            {
                macro_pull_queueBasce_data(uart2_queue_txd,n_bytes,rd_byte_details);
                USART_SendData(USART2,rd_byte_details);
            }
            else
            {
                USART_ITConfig(USART2,USART_IT_TXE,DISABLE);
            }
        }
    }
}
sdt_bool  phyBusBusyFlag2 = sdt_false;

void TIM2_IRQHandler(void)
{
    if(SET==TIM_GetFlagStatus(TIM2,TIM_FLAG_Update))
    {
        TIM_ClearFlag(TIM2,TIM_FLAG_Update); 
        phyBusBusyFlag2 = sdt_false;
        TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
        TIM_ClearFlag(TIM2,TIM_FLAG_Update);               //清除溢出中断标志  
        TIM_ITConfig(TIM2,TIM_IT_Update,DISABLE);  
    }
}

void EXTI9_5_IRQHandler(void)
{
    
    if(EXTI_GetITStatus(EXTI_Line5) != RESET) 
    {//串口2
        EXTI_ClearITPendingBit(EXTI_Line5);
        phyBusBusyFlag2 = sdt_true;
        TIM2->CNT = 0;
        TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
        TIM_ClearFlag(TIM2,TIM_FLAG_Update);               //清除溢出中断标志  
        TIM_ITConfig(TIM2,TIM_IT_Update,ENABLE);     
    }
}

////+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//++++++++++++++++++++++++++++++++interface++++++++++++++++++++++++++++++++++++
//-----------------------------------------------------------------------------
void bsp_uart2_cfg(void)
{
    GPIO_InitTypeDef    GPIO_USART2INIT; 
    USART_InitTypeDef   USART2_INIT;
    NVIC_InitTypeDef    USART2_NVIC_INIT;

 //-----------------------------------------------------------------------------   
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2,ENABLE);  //开启串口时钟
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO,ENABLE);
    GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable,ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);   //开启GPIOA口时钟
//-----------------------------------------------------------------------------  
    GPIO_USART2INIT.GPIO_Pin=GPIO_Pin_2;                   //PA2 U2_TXD
    GPIO_USART2INIT.GPIO_Speed=GPIO_Speed_2MHz;
    GPIO_USART2INIT.GPIO_Mode=GPIO_Mode_AF_PP;            //输出复用推挽
    GPIO_Init(GPIOA,&GPIO_USART2INIT);
    GPIO_SetBits(GPIOA,GPIO_Pin_2);
//-----------------------------------------------------------------------------     
    GPIO_USART2INIT.GPIO_Pin=GPIO_Pin_3;                   //PA3 U2_RXD
    GPIO_USART2INIT.GPIO_Speed=GPIO_Speed_2MHz;
    GPIO_USART2INIT.GPIO_Mode=GPIO_Mode_IPU;               //输入上拉
    GPIO_Init(GPIOA,&GPIO_USART2INIT);
//-----------------------------------------------------------------------------  
    GPIO_USART2INIT.GPIO_Pin=GPIO_Pin_4;                   //PA4 TRSEL
    GPIO_USART2INIT.GPIO_Speed=GPIO_Speed_2MHz;
    GPIO_USART2INIT.GPIO_Mode=GPIO_Mode_IN_FLOATING;            //浮空输入
    GPIO_Init(GPIOA,&GPIO_USART2INIT);
    GPIO_ResetBits(GPIOA,GPIO_Pin_4);
//-----------------------------------------------------------------------------   
    GPIO_USART2INIT.GPIO_Pin = GPIO_Pin_5;               //PA5 BY2  
    GPIO_USART2INIT.GPIO_Mode = GPIO_Mode_IN_FLOATING;//浮空输入
    GPIO_Init(GPIOA, &GPIO_USART2INIT);
    GPIO_ResetBits(GPIOA,GPIO_Pin_5);

    GPIO_EXTILineConfig( GPIO_PortSourceGPIOA,  GPIO_PinSource5); 
    EXTI_InitTypeDef EXTI_InitStructure;
    EXTI_InitStructure.EXTI_Line =  EXTI_Line5;
 
      /* EXTI为中断模式 */
    EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
     /* 上升沿下降沿中断 */
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;//EXTI_Trigger_Rising;//EXTI_Trigger_Rising_Falling
    /* 使能中断 */
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    EXTI_Init(&EXTI_InitStructure);
    
    NVIC_InitTypeDef NVIC_InitStructure;
  
  /* 配置NVIC为优先级组1 */
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1);
  
  /* 配置中断源：按键1 */
    NVIC_InitStructure.NVIC_IRQChannel =  EXTI9_5_IRQn;
  /* 配置抢占优先级 */
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
  /* 配置子优先级 */
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
  /* 使能中断通道 */
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
//-----------------------------------------------------------------------------   
    USART_DeInit(USART2);
    USART2_INIT.USART_BaudRate=9600;
    USART2_INIT.USART_Parity=USART_Parity_No;
    USART2_INIT.USART_WordLength=USART_WordLength_8b;    

    USART2_INIT.USART_StopBits=USART_StopBits_1;
    USART2_INIT.USART_HardwareFlowControl=USART_HardwareFlowControl_None;
    USART2_INIT.USART_Mode=(USART_Mode_Rx+USART_Mode_Tx);  //收发使能
//-----------------------------------------------------------------------------
    USART_Init(USART2,&USART2_INIT);
    USART_ITConfig(USART2,USART_IT_RXNE,ENABLE);           //使能接收中断
    USART_Cmd(USART2,ENABLE);
//-----------------------------------------------------------------------------
    USART2_NVIC_INIT.NVIC_IRQChannel=USART2_IRQn;
    USART2_NVIC_INIT.NVIC_IRQChannelPreemptionPriority=0;  //主优先级
    USART2_NVIC_INIT.NVIC_IRQChannelSubPriority=0;         //子优先级
    USART2_NVIC_INIT.NVIC_IRQChannelCmd=ENABLE;
    NVIC_Init(&USART2_NVIC_INIT);
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
    TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;              //TIM4 3.5T的时序管理
//----------------------------------------------------------------------------- 
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE); 
//-----------------------------------------------------------------------------
    TIM_DeInit(TIM2);
    /* Time base configuration */    
    TIM_TimeBaseStructure.TIM_Prescaler =(720)-1;                    //72M 500k ,2us
    TIM_TimeBaseStructure.TIM_Period =(200-1);                      // 当定时器从0计数到999，即为1000次，为一个定时周期,1个unit 2us
    TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1 ;        //设置时钟分频系数：不分频(这里用不到)
    TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;     //向上计数模式
    TIM_TimeBaseInit(TIM2, &TIM_TimeBaseStructure);
//-----------------------------------------------------------------------------
    TIM_Cmd(TIM2,ENABLE);                              //开启时钟  

