lzly0302/cch.a-control/soft/cch.a/mde/mde_bough_link/depend/bsp_bough_link_stm32f103RCTB.h
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1);  
    NVIC_InitStructure.NVIC_IRQChannel = TIM2_IRQn;       
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;  
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;   
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;  
    NVIC_Init(&NVIC_InitStructure);  
//-------------------------------------------------------------------------------------------
    TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
    TIM_ClearFlag(TIM2,TIM_FLAG_Update);               //清除溢出中断标志  
    TIM_ITConfig(TIM2,TIM_IT_Update,DISABLE);  
    TIM_Cmd(TIM2,ENABLE);                              //开启时钟  
}

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
sdt_int8u bsp_ms_pull_uart2_rxd_num(void)
{
    sdt_int8u n_bytes;
    macro_pull_queueBasce_bytes(uart2_queue_rxd,n_bytes);
    return n_bytes;
}

void bsp_look_for_byte_rx_uart2(void)
{
 
    sdt_int8u n_bytes,rd_byte_details;
    __disable_interrupt();
    macro_pull_queueBasce_bytes(uart2_queue_rxd,n_bytes);
    __enable_interrupt();
    if(n_bytes)
    {
        __disable_interrupt();
        macro_pull_queueBasce_data(uart2_queue_rxd,n_bytes,rd_byte_details);
        __enable_interrupt();
        push_bough_one_receive_byte(bgk_s1,rd_byte_details);     //压入一个字节的数据到link
    }
}
sdt_bool bsp_pull_complete_tx_uart2(void)
{
    sdt_int8u n_bytes;
    
    macro_pull_queueBasce_bytes(uart2_queue_txd,n_bytes);
    if(n_bytes)
    {
        return(sdt_false);
    }
    else
    {
        if(SET==USART_GetITStatus(USART2,USART_IT_TXE))
        {
            return(sdt_false);
        }
        else
        {
            return(sdt_true);
        }      
    }
}
sdt_bool bsp_pull_pyh_busy_uart2(void)
{
    if(phyBusBusyFlag2)
    {
        return(sdt_true);
    }
    return(sdt_false);
}

void bsp_phy_baudrate_calibrate_uart2(void)
{
}

void bsp_entry_phy_rx_uart2(void)
{
    GPIO_InitTypeDef GPIO_InitStructure;
    GPIO_InitStructure.GPIO_Pin=GPIO_Pin_4;
    GPIO_InitStructure.GPIO_Mode=GPIO_Mode_IN_FLOATING; 
    GPIO_Init(GPIOA,&GPIO_InitStructure);
    GPIO_ResetBits(GPIOA,GPIO_Pin_4);
}

void bsp_entry_phy_tx_uart2(void)
{
    ;
}
sdt_int16u bsp_transfet_bytes_tx_uart2(sdt_int8u* in_pByte,sdt_int16u in_expect_bytes,sdt_bool in_conflict_check)
{
    if(0 != in_expect_bytes)
    {
        if(in_conflict_check)
        {
            GPIO_InitTypeDef GPIO_InitStructure;
			GPIO_InitStructure.GPIO_Pin=GPIO_Pin_4;
			GPIO_InitStructure.GPIO_Mode=GPIO_Mode_IN_FLOATING; 
			GPIO_Init(GPIOA,&GPIO_InitStructure);
			GPIO_ResetBits(GPIOA,GPIO_Pin_4);//冲突检测，弱上拉发送
        }
        else
        {
             //推挽发送
			GPIO_InitTypeDef GPIO_InitStructure;
			GPIO_InitStructure.GPIO_Pin=GPIO_Pin_4;                   //PA15 TRSEL
			GPIO_InitStructure.GPIO_Speed=GPIO_Speed_2MHz;
			GPIO_InitStructure.GPIO_Mode=GPIO_Mode_Out_PP;            //推挽输出
			GPIO_Init(GPIOA,&GPIO_InitStructure);
			GPIO_SetBits(GPIOA,GPIO_Pin_4);//推挽发送
        }
        sdt_int8u n_bytes;
        __disable_interrupt();
        macro_pull_queueBasce_bytes(uart2_queue_txd,n_bytes);
        __enable_interrupt();
        sdt_bool queunIsFull;
        macro_pull_queueBasce_full(uart2_queue_txd,n_bytes,queunIsFull);
        if(queunIsFull)
        {
            return(sdt_false);
        }
        else
        {
            __disable_interrupt();
            macro_push_queueBasce_data(uart2_queue_txd,n_bytes,in_pByte[0]);
                __enable_interrupt();
            USART_ITConfig(USART2,USART_IT_TXE,ENABLE);
            return(in_expect_bytes-1);                              
        }     
    }
    return(0);
}
//sdt_bool bsp_ms_pull_uart2_txd_cmp(void)
//{
//    sdt_int8u n_bytes;
//    
//    macro_pull_queueBasce_bytes(uart2_queue_txd,n_bytes);
//    if(n_bytes)
//    {
//        return(sdt_false);
//    }
//    else
//    {
//        if(SET==USART_GetITStatus(USART2,USART_IT_TXE))
//        {
//            return(sdt_false);
//        }
//        else
//        {
//            return(sdt_true);
//        }      
//    }
//}
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
void bsp_uart2_phyReCfg(sdt_int32u sys_fre,sdt_int32u baud_rate,sdt_int8u parity,sdt_int8u stop_bits)
{
    USART_InitTypeDef   USART2_INIT;

    USART_DeInit(USART2);
    USART2_INIT.USART_BaudRate=9600;
    USART2_INIT.USART_Parity=USART_Parity_No;
    USART2_INIT.USART_WordLength=USART_WordLength_8b;    

    USART2_INIT.USART_StopBits=USART_StopBits_1;
    USART2_INIT.USART_HardwareFlowControl=USART_HardwareFlowControl_None;
    USART2_INIT.USART_Mode=(USART_Mode_Rx+USART_Mode_Tx);  //收发使能
//-----------------------------------------------------------------------------
    USART_Init(USART2,&USART2_INIT);
}
//tr_select  PB1
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//input floating

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
